install.packages("tidyverse")

library(MASS)
library(magrittr)
library(dplyr)

#когато работим с непресъснати случайни величини ни се налага да ползваме хистограма
#понеже при непрекъснатите величини се приемат стойности върху реалната права и може
#те да са всякакви. При хистограма стойностите са интервали и се показва тяхната честота

hist(survey$Height, breaks = 100)

rcauchy(10000) %>% hist(breaks = 100)

# qqnorm() се използва да видим дали нещо е нормално разпределено
# нормално разпределено е когато графиката е права линия

#свойства на нормално разпределение
#1.Симетрична графика
#2.Няма тежка опашка
qqnorm(survey$Height)


#1зад.Генерирайте 100 случайни наблюдения на X. Постройте боксплот и хистограма,
#добавете емпирична и теоритична плътност, ако

# а) Х е нормално разпределенео (5,2) първото число е средната стойност, второто е станд отклонение
# б) експоденциално 
# в) нормално
# г) равномерно

N <- 1000

# a)
rgamma(N, 5, 1) %>% boxplot()

# b)
rexp(N, rate = 3) %>% boxplot()

# v)
rnorm(N, mean = 5, sd = 2) %>% boxplot()

# g)
runif(N, min = 1, max = 5) %>% boxplot()

# d) смесено разпределение

# tepm ни е таблица със стойностите от двете разпределения, тя има две колони

#това ни отговаря за номера на колоната, съотв първо и второ разпределение
idx <- sample(1:2, N, replace = TRUE)


temp <- cbind(rnorm(N, 2, 2), rnorm(N, 25, 2))

#това са индексите на всички стойности от двете разпределения
id <- cbind(1:N, idx)

hist(temp[id], probability = T, breaks = 20)
lines(density(temp[id]))

#2зад

#n - брой сл. в
#k - брой стойности, които ни дава всяко разпределение
# fn - distribution function and ... is her arguments

xsim <- function(n, k, fn, ...){
  
  #вектор пълен с нули. В него се събират стойностите поиндексно на всяко разпределение
  s <- rep(0, k)
  for (i in 1:n) {
    s <- s + fn(k, ... )
  }
  #връща се вектор със сумата поиндексно на всички разпределения
  s
}

xsim(100, 100, rexp) %>% hist()


#това ни показва граничната теор - т.е при сумиране на независими еднакво разпр сл.в
#че се получава нормално разпределение
