#тестване на хипотези върху две извадки
#примерно сравенение между хора преди и след вземане на дадено лекарство
#t.test() се ползва когато данните са нормално разпределени
#ако не са ползваме wilcox.test()
#aко пък са пропорции - prop.test()

#example
# брой елементи в двете случайни извадки
n <- 40

# Симулации на случайни извадки от с.в. X ~ N(3, 9) и Y ~ N(4, 9)
x <- rnorm(n, 3, 3)
y <- rnorm(n, 4, 3)

# Извадкови вариации
v1 <- var(x)
v2 <- var(y)

# Степени на свобода за T-разпределението
degrees_of_freedom <- 2 * n - 2

# Наблюдаваната стойност от T-статистиката
t <- (mean(x) - mean(y)) / sqrt(v1 / 40 + v2 / 40)

# Изчисление за pvalue при двустранен тест
pval <- 2 * min(
  pt(q = t, df = degrees_of_freedom, lower.tail = TRUE),
  pt(q = t, df = degrees_of_freedom, lower.tail = FALSE)
)

# резултат
c("t" = t, "pvalue" = pval, "df" = degrees_of_freedom)

#и тук може да се сравни pval с някакво ниво на съгласие alpha
#но може да се направи и с t.test
t.test(x, y, var.equal = TRUE)

#-------------------------------
#има шанс двете извадки да имат различен брой елементи. Тогава ползваме тази ф-ла
# Формула за смесено извадъчно стандартно отклонение
pooled_sd <- function (x, y) {
  n1 <- length(x)
  n2 <- length(y)
  #формулата
  sqrt(
    ((n1 - 1) * var(x) + (n2 - 1) * var(y))
    /
      (n1 + n2 - 2)
  )
}

# броя на елементите в двете случайни извадки които ще симулираме
n <- 30
m <- 40

# Симулации с различен брой над с.в.
x <- rnorm(n, 3, 2)
y <- rnorm(m, 4, 2)

# Степени на свобода
degrees_of_freedom <- n + m - 2

# Наблюдавана стойност t на Т-статистиката
t <- (mean(x) - mean(y)) / (pooled_sd(x, y) * sqrt((1 / n) + (1 / m)))

# Изчисление за pvalue при двустранен тест
pvalue <- 2 * min(
  pt(t, degrees_of_freedom, lower.tail = TRUE),
  pt(t, degrees_of_freedom, lower.tail = FALSE)
)

# резултат
c("t" = t, "pvalue" = pvalue, "df" = degrees_of_freedom)

#но можем отново с t.test()
t.test(x, y, var.equal = TRUE)

#-------------------
#може да имаме две извадки върху един и същ обект. Тогава ползваме друга формула 
# Брой елементи от които ще симулираме извадка
n <- 30

# Симулираме наблюдения от с.в.
x <- rnorm(n, 80, 4)
y <- rnorm(n, 84, 4)

# Тест статистика при сдвоен тест
t <- mean(x - y) / (sd(x - y) / sqrt(30))

# Изчисление на pvalue
pvalue <- 2 * min(pt(t, n - 1), pt(t, n - 1, lower.tail = FALSE))

# резултат
c("t" = t, "pvalue" = pvalue, "df" = n - 1)

#зад1
x <- c(4, 1, 7, 9)
y <- c(10, 3, 2, 11)

#проверяваме дали са нормално разпределени
qqnorm(x)
qqline(x)
qqnorm(y)
qqline(y)

wilcox.test(x, y, alternative = "two.sided")

#при 68% е шансът да са равно, т.е не отхвърляме хипотезата


#зад2 ползваме prop.test защото имаме пропорции
x1 <- 351
n1 <- 605

x2 <- 71
n2 <- 195

#нулевата ни хипотеза е че не са <= тоест да приемем хипотезата че непушачите гласуват
#повече за увеличение цените на цигарите затова alternative = "greater"

prop.test(c(x1, x2), c(n1, n2), alternative = )

#зад3
#данните са на различни пациенти следователно не са сдвоени!

treated_time <- c(15, 10, 13, 7, 9, 8, 21, 9, 14, 8)
placebo_time <- c(15, 14, 12, 8, 14, 10, 7, 16, 10, 15, 12)

#данните се проверяват дали на нормално разпределение- да те са
qqnorm(treated_time)
qqline(treated_time)

qqnorm(placebo_time)
qqline(placebo_time)

#изкаме да видим че с лекарството времето е по-малко следователно изкаме да отхвълим
#нулевата хипотеза че времето с лекарство е >= следователно алтернативата е less
t.test(treated_time, placebo_time, alternative = "less")

