#Генерирайте н на брой наблюдения над N(2,4). Проверете хипотезата:
# а) Но : ЕХ = 5
# б) Но : ЕХ = 3


#нулевата хипотеза ни пита дали ЕХ = 3
n <- 10

#правим разпределението
x <- rnorm(n, 2, 2)

#формулата 
z <- (mean(x) - 3) / (sd(x) / sqrt(n))

#вероятно да се случи хипотезата
pval <- pt(z, df = n-1)

#ниво на съгласие е кога да приемем тази хипотеза за вярна(когато pval < alpha отхвърляме)
alpha <- 0.05

2 * pval < alpha


#зад2
#Данните vacation от пакета UsingR съдържат броя на платените почивни дни за работещите
#в текстилната индустрия.Проверете хипотезата че те почиват 24 дни при ниво на 
#значимост 0.2 

#първо правим проверка дали данните са нормално разпределени - те са
qqnorm(vacation)
qqline(vacation)

library("UsingR")

l <- length(vacation)

alpha <- 0.2

z1 <- (mean(vacation) - 24) / (sd(vacation) / sqrt(l))

pval1 <- pt(z1, df = n - 1)

2 * pval1 < alpha
#хипотезата е вярна
  
#можем и да използваме t.test
t.test(vacation, mu = 24, alternative = "two.sided")

#зад3
#компания твърди че 50% от клиентита са доволни от нейните услуги.Направено е проучване
#при 100 лица 42 от които са доволни.Може ли да се приеме твърдението на компанията
#Променя ли се извода при 420 от 1000 ако са доволни 
#Какъв ще е резултатът, ако твърдението на компанията, че поне 50% са доволни от нейните услуги

alpha2 <- 0.5

#те искат да кажат че 50% са доволни => нашата алтернатива е да кажем че са по-малко от 50 
prop.test(42, 100, alpha2, alternative = 'less')

#pvalue от ф-ята е вероятността нулевата хипотеза да е вярна

#------------

#тест когато данните не са нормално разпределени
?wilcox.test

#зад4.

v <- c(12.8, 3.5, 2.9, 9.4, 8.7, 0.7, 0.2, 2.8, 1.9, 2.8, 3.1, 15.8)

qqnorm(v)
qqline(v)

t.test(v, mu = 5, alternative = "greater")